js216/stm32mp135_test_board/baremetal/qspi/src/cli.c
/* Raw data-only read: IMODE=ADMODE=ABMODE=0, just DMODE on the wire.
 * Matches a generic SPI slave that shifts bits without flash framing. */
static void cmd_raw_read(int argc, char **argv)
{
   uint32_t len  = arg_u32(argc > 0 ? argv[0] : NULL, 16U);
   uint32_t quad = arg_u32(argc > 1 ? argv[1] : NULL, 0U);
   if (len > READ_CAP) len = READ_CAP;
   const qspi_cmd_t c = {
      .inst_lines = QSPI_LINES_NONE,
      .addr_lines = QSPI_LINES_NONE,
      .alt_lines  = QSPI_LINES_NONE,
      .data_lines = quad ? QSPI_LINES_4 : QSPI_LINES_1,
      .data_len   = len,
   };
   if (qspi_xfer(&c, QSPI_FMODE_READ, io_buf, 5000U) != HAL_OK) {
      my_printf("ERR raw_read\r\n");
      return;
   }
   my_printf("raw read %lu (%s)\r\n",
             (unsigned long)len, quad ? "quad" : "1lane");
   hexdump(0U, io_buf, len);
}

/* Raw data-only write: clocks out the supplied bytes (or 0xAA pattern
 * if no bytes given but a length is) with no opcode/address phase. */
static void cmd_raw_write(int argc, char **argv)
{
   uint32_t quad = 0U;
   uint32_t len  = (uint32_t)argc;
   if (len == 0U) {
      my_printf("usage: J <b0> [b1...] (last arg may be quad=N)\r\n");
      return;
   }
   /* Treat trailing arg "q=1" via large value > 0xFF heuristic: keep it
    * simple, callers pass bytes only.  Quad mode is selected through
    * the bench cmd `b` instead. */
   for (int i = 0; i < argc && i < (int)READ_CAP; i++)
      io_buf[i] = (uint8_t)arg_u32(argv[i], 0U);
   const qspi_cmd_t c = {
      .inst_lines = QSPI_LINES_NONE,
      .addr_lines = QSPI_LINES_NONE,
      .alt_lines  = QSPI_LINES_NONE,
      .data_lines = quad ? QSPI_LINES_4 : QSPI_LINES_1,
      .data_len   = len,
   };
   if (qspi_xfer(&c, QSPI_FMODE_WRITE, io_buf, 5000U) != HAL_OK) {
      my_printf("ERR raw_write\r\n");
      return;
   }
   my_printf("raw wrote %lu bytes\r\n", (unsigned long)len);
}

static void cmd_op_only(int argc, char **argv)
{
   uint32_t opc = arg_u32(argc > 0 ? argv[0] : NULL, 0x06U);
   const qspi_cmd_t c = {
      .instruction = (uint8_t)opc, .inst_lines = QSPI_LINES_1,
   };
   if (qspi_xfer(&c, QSPI_FMODE_WRITE, NULL, 100U) != HAL_OK) {
      my_printf("ERR op\r\n");
      return;
   }
   my_printf("op=%02x sent\r\n", (unsigned)opc);
}

static void cmd_wrsr(int argc, char **argv)
{
   uint32_t val = arg_u32(argc > 0 ? argv[0] : NULL, 0U);
   uint32_t opc = arg_u32(argc > 1 ? argv[1] : NULL, 0x01U);
   uint8_t  v   = (uint8_t)val;
   const qspi_cmd_t c = {
      .instruction = (uint8_t)opc,
      .inst_lines  = QSPI_LINES_1,
      .data_lines  = QSPI_LINES_1,
      .data_len    = 1U,
   };
   if (qspi_xfer(&c, QSPI_FMODE_WRITE, &v, 100U) != HAL_OK) {
      my_printf("ERR wrsr\r\n");
      return;
   }
   my_printf("op=%02x wrote SR=%02x\r\n", (unsigned)opc, (unsigned)v);
}

static void cmd_pp(int argc, char **argv)
{
   uint32_t addr = arg_u32(argc > 0 ? argv[0] : NULL, 0U);
   uint32_t len  = arg_u32(argc > 1 ? argv[1] : NULL, 16U);
   uint32_t opc  = arg_u32(argc > 2 ? argv[2] : NULL, 0x02U);
   if (len > WRITE_CAP) len = WRITE_CAP;
   for (uint32_t i = 0; i < len; i++)
      io_buf[i] = (uint8_t)(i & 0xFFU);
   const qspi_cmd_t c = {
      .instruction = (uint8_t)opc,
      .address     = addr, .addr_bytes = 3U,
      .inst_lines  = QSPI_LINES_1, .addr_lines = QSPI_LINES_1,
      .data_lines  = QSPI_LINES_1, .data_len   = len,
   };
   if (qspi_xfer(&c, QSPI_FMODE_WRITE, io_buf, 5000U) != HAL_OK) {
      my_printf("ERR pp\r\n");
      return;
   }
   my_printf("op=%02x wrote %lu bytes @ 0x%08lx\r\n",
             (unsigned)opc, (unsigned long)len, (unsigned long)addr);
}

static void cmd_qpp(int argc, char **argv)
{
   uint32_t addr = arg_u32(argc > 0 ? argv[0] : NULL, 0U);
   uint32_t len  = arg_u32(argc > 1 ? argv[1] : NULL, 16U);
   if (len > WRITE_CAP) len = WRITE_CAP;
   for (uint32_t i = 0; i < len; i++)
      io_buf[i] = (uint8_t)(0xC0U + (i & 0x0FU));
   const qspi_cmd_t c = {
      .instruction = 0x32U,
      .address     = addr, .addr_bytes = 3U,
      .inst_lines  = QSPI_LINES_1, .addr_lines = QSPI_LINES_1,
      .data_lines  = QSPI_LINES_4, .data_len   = len,
   };
   if (qspi_xfer(&c, QSPI_FMODE_WRITE, io_buf, 5000U) != HAL_OK) {
      my_printf("ERR qpp\r\n");
      return;
   }
   my_printf("op=32 wrote %lu bytes @ 0x%08lx\r\n",
             (unsigned long)len, (unsigned long)addr);
}

static void cmd_erase(uint8_t opc, uint32_t kib_or_zero,
                      int argc, char **argv)
{
   uint32_t addr = arg_u32(argc > 0 ? argv[0] : NULL, 0U);
   const qspi_cmd_t c = {
      .instruction = opc,
      .address     = addr, .addr_bytes = 3U,
      .inst_lines  = QSPI_LINES_1, .addr_lines = QSPI_LINES_1,
   };
   if (qspi_xfer(&c, QSPI_FMODE_WRITE, NULL, 1000U) != HAL_OK) {
      my_printf("ERR erase\r\n");
      return;
   }
   if (kib_or_zero)
      my_printf("op=%02x erased %lu KB @ 0x%08lx\r\n",
                (unsigned)opc, (unsigned long)kib_or_zero,
                (unsigned long)addr);
   else
      my_printf("op=%02x erased chip\r\n", (unsigned)opc);
}

static void cmd_chip_erase_pending(void)
{
   pend_confirm_C_until = HAL_GetTick() + 2000U;
   my_printf("Type C again to confirm.\r\n");
}

static void cmd_chip_erase_do(void)
{
   const qspi_cmd_t c = {
      .instruction = 0xC7U, .inst_lines = QSPI_LINES_1,
   };
   if (qspi_xfer(&c, QSPI_FMODE_WRITE, NULL, 1000U) != HAL_OK) {
      my_printf("ERR chip\r\n");
      return;
   }
   my_printf("op=c7 erased chip\r\n");
}

static void cmd_autopoll(int argc, char **argv)
{
   uint32_t opc   = arg_u32(argc > 0 ? argv[0] : NULL, 0x05U);
   uint32_t mask  = arg_u32(argc > 1 ? argv[1] : NULL, 0x01U);
   uint32_t match = arg_u32(argc > 2 ? argv[2] : NULL, 0x00U);
   const qspi_cmd_t c = {
      .instruction = (uint8_t)opc,
      .inst_lines  = QSPI_LINES_1,
      .data_lines  = QSPI_LINES_1,
      .data_len    = 1U,
   };
   busy_flag = true;
   uint32_t t0 = HAL_GetTick();
   HAL_StatusTypeDef s = qspi_autopoll(&c, mask, match, 16U, 5000U);
   uint32_t dt = HAL_GetTick() - t0;
   busy_flag = false;
   if (s == HAL_OK)
      my_printf("autopoll op=%02x mask=%02lx match=%02lx done in %lu ms\r\n",
                (unsigned)opc, (unsigned long)mask, (unsigned long)match,
                (unsigned long)dt);
   else
      my_printf("autopoll TIMEOUT after %lu ms\r\n", (unsigned long)dt);
}

