js216/stm32mp135_test_board/baremetal/qspi/src/cli.c
static void cmd_4byte(int argc, char **argv)
{
   bool enter;
   if (argc > 0)
      enter = arg_u32(argv[0], 0U) != 0U;
   else
      enter = !four_byte_mode;
   uint8_t opc = enter ? 0xB7U : 0xE9U;
   const qspi_cmd_t c = {
      .instruction = opc, .inst_lines = QSPI_LINES_1,
   };
   if (qspi_xfer(&c, QSPI_FMODE_WRITE, NULL, 100U) != HAL_OK) {
      my_printf("ERR 4byte\r\n");
      return;
   }
   four_byte_mode = enter;
   my_printf("4byte=%d (op=%02x)\r\n", enter ? 1 : 0, (unsigned)opc);
}

static void cmd_reset(void)
{
   const qspi_cmd_t a = { .instruction = 0x66U, .inst_lines = QSPI_LINES_1 };
   const qspi_cmd_t b = { .instruction = 0x99U, .inst_lines = QSPI_LINES_1 };
   if (qspi_xfer(&a, QSPI_FMODE_WRITE, NULL, 100U) != HAL_OK ||
       qspi_xfer(&b, QSPI_FMODE_WRITE, NULL, 100U) != HAL_OK) {
      my_printf("ERR reset\r\n");
      return;
   }
   my_printf("reset (66 99) sent\r\n");
}

static void cmd_dpd(void)
{
   const qspi_cmd_t c = { .instruction = 0xB9U, .inst_lines = QSPI_LINES_1 };
   if (qspi_xfer(&c, QSPI_FMODE_WRITE, NULL, 100U) != HAL_OK) {
      my_printf("ERR dpd\r\n");
      return;
   }
   my_printf("op=b9 deep power-down\r\n");
}

static void cmd_release_dpd(void)
{
   const qspi_cmd_t c = { .instruction = 0xABU, .inst_lines = QSPI_LINES_1 };
   if (qspi_xfer(&c, QSPI_FMODE_WRITE, NULL, 100U) != HAL_OK) {
      my_printf("ERR rdpd\r\n");
      return;
   }
   my_printf("op=ab release DPD\r\n");
}

static void cmd_prescaler(int argc, char **argv)
{
   uint32_t p = arg_u32(argc > 0 ? argv[0] : NULL, qspi_get_prescaler());
   if (p > 255U) {
      my_printf("ERR presc range\r\n");
      return;
   }
   /* Enable 1/2-cycle sample shift at high SCLK so MISO sampling is
    * stable above ~50 MHz.  ker_ck on this project is ~266 MHz, so
    * presc <= 3 (>=66 MHz) gets the shift. */
   const uint32_t sshift = (p <= 3U) ? 1U : 0U;
   if (qspi_init(p, qspi_get_fsize(), qspi_get_csht(), sshift, false)
       != HAL_OK) {
      my_printf("ERR reinit\r\n");
      return;
   }
   busy_flag = false;
   my_printf("presc=%lu sshift=%lu\r\n",
             (unsigned long)p, (unsigned long)sshift);
}

/* -------- raw GPIO bring-up helpers ------------------------------- */

struct pin_def {
   GPIO_TypeDef *port;
   uint32_t      pin;
   const char   *name;
};

static const struct pin_def pins[6] = {
   { QSPI_CLK_PORT, QSPI_CLK_PIN, "CLK" },
   { QSPI_NCS_PORT, QSPI_NCS_PIN, "NCS" },
   { QSPI_IO0_PORT, QSPI_IO0_PIN, "IO0" },
   { QSPI_IO1_PORT, QSPI_IO1_PIN, "IO1" },
   { QSPI_IO2_PORT, QSPI_IO2_PIN, "IO2" },
   { QSPI_IO3_PORT, QSPI_IO3_PIN, "IO3" },
};

static void force_gpio_outputs(void)
{
   QUADSPI->CR &= ~QUADSPI_CR_EN;
   for (int i = 0; i < 6; i++) {
      GPIO_InitTypeDef g = {
         .Pin   = pins[i].pin,
         .Mode  = GPIO_MODE_OUTPUT_PP,
         .Pull  = GPIO_NOPULL,
         .Speed = GPIO_SPEED_FREQ_VERY_HIGH,
      };
      HAL_GPIO_Init(pins[i].port, &g);
   }
}

static void cmd_gpio(int argc, char **argv)
{
   uint32_t mask = arg_u32(argc > 0 ? argv[0] : NULL, 0U);
   /* Disabling QUADSPI breaks the auto-JEDEC loop; suspend it. */
   busy_flag = true;
   force_gpio_outputs();
   for (int i = 0; i < 6; i++) {
      GPIO_PinState s = (mask >> i) & 1U ? GPIO_PIN_SET : GPIO_PIN_RESET;
      HAL_GPIO_WritePin(pins[i].port, pins[i].pin, s);
   }
   my_printf("gpio mask=0x%02lx:", (unsigned long)mask);
   for (int i = 0; i < 6; i++) {
      int rb = HAL_GPIO_ReadPin(pins[i].port, pins[i].pin) == GPIO_PIN_SET;
      my_printf(" %s=%d", pins[i].name, rb);
   }
   my_printf("\r\n");
}

static void cmd_toggle(int argc, char **argv)
{
   uint32_t per = arg_u32(argc > 0 ? argv[0] : NULL, 1U);
   force_gpio_outputs();
   my_printf("toggle period=%lu ms (reset to stop)\r\n",
             (unsigned long)per);
   busy_flag = true;
   uint32_t lvl = 0;
   while (1) {
      for (int i = 0; i < 6; i++)
         HAL_GPIO_WritePin(pins[i].port, pins[i].pin,
                           lvl ? GPIO_PIN_SET : GPIO_PIN_RESET);
      lvl ^= 1U;
      HAL_Delay(per);
   }
}

static void cmd_abort(void)
{
   qspi_abort();
   /* drain RX FIFO of any leftover data from a botched read */
   while (QUADSPI->SR & QUADSPI_SR_FTF)
      (void)QUADSPI->DR;
   my_printf("abort\r\n");
}

/* -------- dispatch ------------------------------------------------ */

static void dispatch(char *line)
{
   while (*line == ' ' || *line == '\t')
      line++;
   if (!*line)
      return;
   char op = *line++;
   while (*line == ' ' || *line == '\t')
      line++;

   /* chip-erase double-tap confirmation */
   if (op == 'C' && pend_confirm_C_until &&
       (int32_t)(HAL_GetTick() - pend_confirm_C_until) < 0) {
      pend_confirm_C_until = 0;
      cmd_chip_erase_do();
      return;
   }
   pend_confirm_C_until = 0;

   char *argv[MAX_ARGS];
   int argc = parse_args(line, argv, MAX_ARGS);

   switch (op) {
      case 'i': cmd_jedec();                      break;
      case 'f': cmd_sfdp(argc, argv);             break;
      case 's': cmd_status(argc, argv);           break;
      case '?': cmd_query();                      break;
      case 'r': cmd_read(argc, argv);             break;
      case 'F': cmd_fast_read(argc, argv);        break;
      case 'q': cmd_quad_read(argc, argv);        break;
      case 'X': cmd_quad_io_read(argc, argv);     break;
      case '2': cmd_dual_read(argc, argv);        break;
      case '3': cmd_dual_io_read(argc, argv);     break;
      case 'M': cmd_mm(argc, argv);               break;
      case 'b': cmd_bench(argc, argv);            break;
      case 'j': cmd_raw_read(argc, argv);         break;
      case 'J': cmd_raw_write(argc, argv);        break;
      case 'e': cmd_op_only(argc, argv);          break;
      case 'W': cmd_wrsr(argc, argv);             break;
      case 'w': cmd_pp(argc, argv);               break;
      case 'Q': cmd_qpp(argc, argv);              break;
      case 'S': cmd_erase(0x20U, 4U, argc, argv); break;
      case 'B': cmd_erase(0xD8U, 64U, argc, argv);break;
      case 'C': cmd_chip_erase_pending();         break;
      case 'P': cmd_autopoll(argc, argv);         break;
      case '4': cmd_4byte(argc, argv);            break;
      case 'R': cmd_reset();                      break;
      case 'D': cmd_dpd();                        break;
      case 'd': cmd_release_dpd();                break;
      case 'p': cmd_prescaler(argc, argv);        break;
      case 'g': cmd_gpio(argc, argv);             break;
      case 't': cmd_toggle(argc, argv);           break;
      case 'x': cmd_abort();                      break;
      case 'h': cmd_help();                       break;
      default:
         my_printf("? unknown '%c' (h for help)\r\n", op);
         break;
   }
}

static void cli_putc(char c)
{
   while (!(UART4->ISR & USART_ISR_TXE))
      rx_drain_hw();
   UART4->TDR = (uint8_t)c;
   while (!(UART4->ISR & USART_ISR_TC))
      rx_drain_hw();
}

void cli_init(void)
{
   linelen   = 0;
   busy_flag = false;
   rx_head   = 0;
   rx_tail   = 0;
   /* clear stale RX */
   while (UART4->ISR & USART_ISR_RXNE_RXFNE)
      (void)UART4->RDR;
   /* Re-route printf so that long TX bursts can't drop incoming RX. */
   printf_set_output(cli_putc);
   prompt();
}

void cli_poll(void)
{
   int b;
   while (uart_rx_byte(&b)) {
      char c = (char)b;
      if (c == '\r' || c == '\n') {
         uart_tx_byte('\r');
         uart_tx_byte('\n');
         linebuf[linelen] = '\0';
         dispatch(linebuf);
         linelen = 0;
         prompt();
      } else if (c == '\b' || c == 0x7F) {
         if (linelen > 0) {
            linelen--;
            uart_tx_byte('\b');
            uart_tx_byte(' ');
            uart_tx_byte('\b');
         }
      } else if (c >= 0x20 && c < 0x7F && linelen < LINEMAX) {
         linebuf[linelen++] = c;
         uart_tx_byte(c);
      }
   }
}
